[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        this._faces = faces;
-        //initialize distribution and last
-        this._distribution = new Map();
-        for(let i = 1; i <= faces; i++){
-            this._distribution.set(i, 0);
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Tests for six faced die Roll 3 for 6 faced die
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/Roller.ts:13:24
         this._faces = faces;
         //initialize distribution and last
         this._distribution = new Map();
-        for(let i = 1; i <= faces; i++){
+        for(let i = 1; i < faces; i++){
             this._distribution.set(i, 0);
         }
killedBy: Tests for 12 faced die Check Final Distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Timeout] BlockStatement
src/Roller.ts:28:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if(value > 0 && value <= this._faces) {
-            this._last = value;
-            var previousValue = this._distribution.get(value);
-            this._distribution.set(value, previousValue+1);
-            return value;
-        }
-
-        else {
-            return 0;
-        }
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made

[Killed] ConditionalExpression
src/Roller.ts:29:25
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if(value > 0 && value <= this._faces) {
+        if(value > 0 && true) {
             this._last = value;
             var previousValue = this._distribution.get(value);
killedBy: Tests for six faced die Roll 12 for 6 faced die
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 12

[Timeout] BlockStatement
src/Roller.ts:29:47
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if(value > 0 && value <= this._faces) {
-            this._last = value;
-            var previousValue = this._distribution.get(value);
-            this._distribution.set(value, previousValue+1);
-            return value;
-        }
+        if(value > 0 && value <= this._faces) {}
 
         else {

[Timeout] ArithmeticOperator
src/Roller.ts:32:43
         if(value > 0 && value <= this._faces) {
             this._last = value;
             var previousValue = this._distribution.get(value);
-            this._distribution.set(value, previousValue+1);
+            this._distribution.set(value, previousValue - 1);
             return value;
         }

[Killed] BlockStatement
src/Roller.ts:36:14
             return value;
         }
 
-        else {
-            return 0;
-        }
+        else {}
     }
 
killedBy: Tests for six faced die Roll 0 for 6 faced die
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
